In [9]:
# Loads the adapted_scifi_films_db into pandas dataframes

from pymongo import MongoClient
import pandas as pd

In [10]:
conn = 'mongodb://localhost:27017'
client = MongoClient(conn)
db = client.adapted_scifi_films_db

In [43]:
books_collection = db.books.find()
movies_collection = db.movies.find()

In [44]:
books_df = pd.DataFrame(list(books_collection))
movies_df = pd.DataFrame(list(movies_collection))

In [45]:
books_df = books_df.drop(["_id"], axis=1)
print(books_df.shape)
books_df.head()

(199, 4)

,Average Votes,Book Rating,Book Title,Title
0,156130,3.92,Around the World in Eighty Days (Extraordinary...,around the world in eighty days
1,17377,3.89,Invasion of the Body Snatchers,body snatchers
2,992321,3.77,Frankenstein,frankenstein
3,139972,3.85,Invisible Man,the invisible man
4,126382,3.85,Journey to the Center of the Earth (Extraordin...,journey to the center of the earth

In [46]:
movies_df = movies_df.drop(["_id"], axis=1)
print(movies_df.shape)
movies_df.head()

(214, 3)

   Movie Rating  Movie Revenue                               Title
0           7.8            NaN     around the world in eighty days
1           5.9            NaN                      body snatchers
2           7.9            NaN                        frankenstein
3           7.7            NaN                   the invisible man
4           5.8    101653320.0  journey to the center of the earth

In [66]:
CombinedDF = pd.merge(books_df, movies_df, on="Title", how="inner")

In [67]:
print(CombinedDF.shape)
CombinedDF.tail()

(203, 6)

,Average Votes,Book Rating,Book Title,Title,Movie Rating,Movie Revenue
198,23,3.57,"Woman of the Sun, Woman of the Moon",woman in the moon,7.4,NaN
199,17523,3.96,Ghost in the Wires: My Adventures as the World...,world on a wire,7.9,NaN
200,133,3.92,"The World, the Flesh and the Devil","the world, the flesh and the devil",7.0,NaN
201,829770,4.02,"A Wrinkle in Time (Time Quintet, #1)",a wrinkle in time,4.2,NaN
202,12705,3.65,Z for Zachariah,z for zachariah,6.0,118483.0